Juan/risingBubble/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    sideRight
    {
        type            cyclic; // Periodic boundary conditions
    }
    sideLeft
    {
        type            cyclic; // Periodic boundary conditions
    }
    frontback
    {
        type            empty; // Periodic boundary conditions
    }
}


// ************************************************************************* //
